onliner10/edgetx/radio/src/targets/common/arm/stm32/diskio_sdio.cpp
/*
 * Copyright (C) EdgeTX
 *
 * Based on code named
 *   opentx - https://github.com/opentx/opentx
 *   th9x - http://code.google.com/p/th9x
 *   er9x - http://code.google.com/p/er9x
 *   gruvin9x - http://code.google.com/p/gruvin9x
 *
 * License GPLv2: http://www.gnu.org/licenses/gpl-2.0.html
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 */


#include "diskio_sdio.h"
#include "hal/gpio.h"

#include "stm32_dma.h"
#include "stm32_hal.h"
#include "stm32_hal_ll.h"
#include "stm32_gpio_driver.h"
#include "stm32_gpio.h"

#include "hal.h"


#if defined(STORAGE_USE_SDIO)

// #include "delays_driver.h"
#include "debug.h"

#if !defined(BOOT)
  #include "timers_driver.h"
  #define WATCHDOG_SUSPEND(x) watchdogSuspend(x)
#else
  #define WATCHDOG_SUSPEND(...)
#endif

#include <string.h>

#if !defined(SD_SDIO_PIN_D0)
#  define SD_SDIO_PIN_D0 GPIO_PIN(GPIOC, 8)
#  if defined(STM32H7RS)
#    define SD_SDIO_AF_D0  GPIO_AF11
#  else
#    define SD_SDIO_AF_D0  GPIO_AF12
#  endif
#endif

#if !defined(SD_SDIO_PIN_D1)
#  define SD_SDIO_PIN_D1 GPIO_PIN(GPIOC, 9)
#  if defined(STM32H7RS)
#    define SD_SDIO_AF_D1  GPIO_AF11
#  else
#    define SD_SDIO_AF_D1  GPIO_AF12
#  endif
#endif

#if !defined(SD_SDIO_PIN_D2)
#  define SD_SDIO_PIN_D2 GPIO_PIN(GPIOC, 10)
#  define SD_SDIO_AF_D2  GPIO_AF12
#endif

#if !defined(SD_SDIO_PIN_D3)
#  define SD_SDIO_PIN_D3 GPIO_PIN(GPIOC, 11)
#  if defined(STM32H7RS)
#    define SD_SDIO_AF_D3  GPIO_AF11
#  else
#    define SD_SDIO_AF_D3  GPIO_AF12
#  endif
#endif

#if !defined(SD_SDIO_PIN_CMD)
#  define SD_SDIO_PIN_CMD GPIO_PIN(GPIOD, 2)
#  if defined(STM32H7RS)
#    define SD_SDIO_AF_CMD  GPIO_AF11
#  else
#    define SD_SDIO_AF_CMD  GPIO_AF12
#  endif
#endif

#if !defined(SD_SDIO_PIN_CLK)
#  define SD_SDIO_PIN_CLK GPIO_PIN(GPIOC, 12)
#  if defined(STM32H7RS)
#    define SD_SDIO_AF_CLK  GPIO_AF11
#  else
#    define SD_SDIO_AF_CLK  GPIO_AF12
#  endif
#endif


#if defined(SDMMC1)
#  define SD_SDIO_TypeDef SDMMC_TypeDef
#  define SD_SDIO_CLOCK_EDGE_RISING SDMMC_CLOCK_EDGE_RISING
#  define SD_SDIO_CLOCK_POWER_SAVE_DISABLE SDMMC_CLOCK_POWER_SAVE_DISABLE
#  define SD_SDIO_BUS_WIDE_1B SDMMC_BUS_WIDE_1B
#  define SD_SDIO_BUS_WIDE_4B SDMMC_BUS_WIDE_4B
#  define SD_SDIO_HARDWARE_FLOW_CONTROL_DISABLE SDMMC_HARDWARE_FLOW_CONTROL_DISABLE
#  define SD_SDIO_IRQn SDMMC1_IRQn
#else
#  if !defined(SD_SDIO)
#    define SD_SDIO SDIO
#  endif
#  define _SD_SDIO_CLK_ENABLE()  __HAL_RCC_SDIO_CLK_ENABLE()
#  define _SD_SDIO_CLK_DISABLE()  __HAL_RCC_SDIO_CLK_DISABLE()
#  define SD_SDIO_IRQHandler SDIO_IRQHandler
#  define SD_SDIO_IRQn       SDIO_IRQn
#  define SD_SDIO_TypeDef    SDIO_TypeDef
#  define SD_SDIO_CLOCK_EDGE_RISING SDIO_CLOCK_EDGE_RISING
#  define SD_SDIO_CLOCK_POWER_SAVE_DISABLE SDIO_CLOCK_POWER_SAVE_DISABLE
#  define SD_SDIO_CLOCK_BYPASS_DISABLE SDIO_CLOCK_BYPASS_DISABLE
#  define SD_SDIO_BUS_WIDE_1B SDIO_BUS_WIDE_1B
#  define SD_SDIO_BUS_WIDE_4B SDIO_BUS_WIDE_4B
#  define SD_SDIO_HARDWARE_FLOW_CONTROL_DISABLE SDIO_HARDWARE_FLOW_CONTROL_DISABLE
#endif

struct {
  SD_SDIO_TypeDef* periph = SD_SDIO;
  gpio_t  D0 = SD_SDIO_PIN_D0;
  gpio_t  D1 = SD_SDIO_PIN_D1;
  gpio_t  D2 = SD_SDIO_PIN_D2;
  gpio_t  D3 = SD_SDIO_PIN_D3;
  gpio_t  CMD = SD_SDIO_PIN_CMD;
  gpio_t  CLK = SD_SDIO_PIN_CLK;
  gpio_af_t  AF_D0 = SD_SDIO_AF_D0;
  gpio_af_t  AF_D1 = SD_SDIO_AF_D1;
  gpio_af_t  AF_D2 = SD_SDIO_AF_D2;
  gpio_af_t  AF_D3 = SD_SDIO_AF_D3;
  gpio_af_t  AF_CMD = SD_SDIO_AF_CMD;
  gpio_af_t  AF_CLK = SD_SDIO_AF_CLK;
  IRQn_Type  IRQn = SD_SDIO_IRQn;
  uint32_t SD_CLK_DIV = SD_SDIO_TRANSFER_CLK_DIV;
} currentSD;

#if FF_MAX_SS != FF_MIN_SS
#error "Variable sector size is not supported"
#endif

#define BLOCK_SIZE FF_MAX_SS
#if defined(RADIO_PA01)
  #define SD_TIMEOUT 1000 /* 1000ms */
#else
  #define SD_TIMEOUT 300 /* 300ms */
#endif
#if defined(STM32F4)
extern uint32_t _sram;
extern uint32_t _heap_start;
#if defined(SDRAM)
#define _IS_DMA_BUFFER(addr)                                                   \
  (((((intptr_t)(addr)) & 0xFF000000) == (((intptr_t)&_sram) & 0xFF000000)) || \
   ((((intptr_t)(addr)) & 0xFC000000) ==                                       \
    (((intptr_t)&_heap_start) & 0xFC000000)))
#else
#define _IS_DMA_BUFFER(addr) \
  ((((intptr_t)(addr)) & 0xFF000000) == (((intptr_t)&_sram) & 0xFF000000))
#endif
#elif defined(STM32H7) || defined(STM32H7RS)
extern uint32_t _sram;
extern uint32_t _s_dram;
extern uint32_t _heap_start;
#define _IS_DMA_BUFFER(addr)                                                   \
  (((((intptr_t)(addr)) & 0xFF000000) == (((intptr_t)&_sram) & 0xFF000000)) || \
   ((((intptr_t)(addr)) & 0xFFF60000) ==                                       \
    (((intptr_t)&_s_dram) & 0xFFF60000)) ||                                    \
   ((((intptr_t)(addr)) & 0xFC000000) ==                                       \
    (((intptr_t)&_heap_start) & 0xFC000000)))
#else
#define _IS_DMA_BUFFER(addr) (true)
#endif

#define _IS_ALIGNED(addr) (((intptr_t)(addr) & 3U) == 0U)

// HAL state
static SD_HandleTypeDef sdio;
#if defined(SD_SDIO_DMA)
#if defined(STM32H7) || defined(STM32H7RS) || defined(STM32H5)
static_assert(false,"H7/H5 use dedicated DMA controler");
#else
static DMA_HandleTypeDef sdioTxDma;
#endif
#endif

// Disk status
enum class DmaTransferStatus : uint8_t {
  Pending,
  Success,
  Error
};

enum class SdioWaitResult : uint8_t {
  Ready,
  Error,
  Timeout
};

enum class ActiveTransfer : uint8_t {
  None,
  Read,
  Write
};

enum class SdioDriverState : uint8_t {
  Uninitialized,
  Ready,
  Failed
};

enum class SdioFaultReason : uint8_t {
  StartReadFailed,
  StartWriteFailed,
  ReadError,
  WriteError,
  ReadTimeout,
  WriteTimeout,
  ReadNotReady,
  WriteNotReady,
  SyncTimeout
};

static volatile DmaTransferStatus WriteStatus = DmaTransferStatus::Pending;
static volatile DmaTransferStatus ReadStatus = DmaTransferStatus::Pending;
static volatile ActiveTransfer activeTransfer = ActiveTransfer::None;
static volatile SdioDriverState driverState = SdioDriverState::Uninitialized;

#if defined(SD_SDIO_DMA)
constexpr uint32_t SDIO_DMA_ABORT_TIMEOUT_MS = 5;
#endif

static void sdio_reset_transfer_state()
{
  ReadStatus = DmaTransferStatus::Pending;
  WriteStatus = DmaTransferStatus::Pending;
  activeTransfer = ActiveTransfer::None;
}

static void sdio_disable_irqs()
{
  NVIC_DisableIRQ(currentSD.IRQn);
  NVIC_ClearPendingIRQ(currentSD.IRQn);
#if defined(SD_SDIO_DMA)
  NVIC_DisableIRQ(SD_SDIO_DMA_IRQn);
  NVIC_ClearPendingIRQ(SD_SDIO_DMA_IRQn);
#endif
  __DSB();
  __ISB();
}

static void sdio_stop_data_path()
{
  if (sdio.Instance == nullptr) return;

  sdio.Instance->MASK = 0;
  sdio.Instance->DCTRL = 0;
#if defined(SDMMC1)
  sdio.Instance->DLEN = 0;
  sdio.Instance->IDMACTRL = SDMMC_DISABLE_IDMA;
#endif
  sdio.Instance->ICR = 0xFFFFFFFFU;
}

static void sdio_abort_active_transfer()
{
  if (sdio.Instance == nullptr) return;

  if (activeTransfer != ActiveTransfer::None ||
      sdio.State == HAL_SD_STATE_BUSY) {
    HAL_StatusTypeDef status = HAL_SD_Abort(&sdio);
    if (status != HAL_OK) {
      TRACE("SDIO abort status=%d err=%lu", status, HAL_SD_GetError(&sdio));
    }
  }
}

static void sdio_stop_dma()
{
#if defined(SD_SDIO_DMA)
  if (sdioTxDma.Instance != nullptr) {
    if (sdioTxDma.State == HAL_DMA_STATE_BUSY) {
      HAL_StatusTypeDef status = HAL_DMA_Abort(&sdioTxDma);
      if (status != HAL_OK) {
        TRACE("SDIO DMA abort status=%d err=%lu", status, sdioTxDma.ErrorCode);
      }
    }

    __HAL_DMA_DISABLE(&sdioTxDma);

    uint32_t timeout = HAL_GetTick();
    while ((sdioTxDma.Instance->CR & DMA_SxCR_EN) != 0U) {
      if ((HAL_GetTick() - timeout) > SDIO_DMA_ABORT_TIMEOUT_MS) {
        TRACE("SDIO DMA disable timeout");
        break;
      }
    }
  }
#endif
}

static void sdio_fail_stop(SdioFaultReason reason)
{
  TRACE("SDIO fail-stop reason=%u", (uint32_t)reason);
  driverState = SdioDriverState::Failed;
  sdio_disable_irqs();
  sdio_abort_active_transfer();
  sdio_stop_data_path();
  sdio_stop_dma();

  sdio_reset_transfer_state();
  HAL_SD_DeInit(&sdio);
}

static DRESULT sdio_fail_result(SdioFaultReason reason)
{
  sdio_fail_stop(reason);
  return RES_ERROR;
}

static void _sd_sdio_clk_enable(SD_SDIO_TypeDef* periph)
{
#if defined(SDMMC1)
  if (periph == SDMMC1) {
    __HAL_RCC_SDMMC1_CLK_ENABLE();
  } else if(periph == SDMMC2) {
    __HAL_RCC_SDMMC2_CLK_ENABLE();
  }
#else
  (void)periph;
  __HAL_RCC_SDIO_CLK_ENABLE();
#endif
}

static void sdio_low_level_init(void)
{
  _sd_sdio_clk_enable(currentSD.periph);

  // data pins
  gpio_init(currentSD.D0, GPIO_IN_PU, GPIO_PIN_SPEED_VERY_HIGH);
  gpio_set_af(currentSD.D0, currentSD.AF_D0);

  gpio_init(currentSD.D1, GPIO_IN_PU, GPIO_PIN_SPEED_VERY_HIGH);
  gpio_set_af(currentSD.D1, currentSD.AF_D1);

  gpio_init(currentSD.D2, GPIO_IN_PU, GPIO_PIN_SPEED_VERY_HIGH);
  gpio_set_af(currentSD.D2, currentSD.AF_D2);

  gpio_init(currentSD.D3, GPIO_IN_PU, GPIO_PIN_SPEED_VERY_HIGH);
  gpio_set_af(currentSD.D3, currentSD.AF_D3);

  gpio_init(currentSD.CMD, GPIO_IN_PU, GPIO_PIN_SPEED_VERY_HIGH);
  gpio_set_af(currentSD.CMD, currentSD.AF_CMD);

  gpio_init(currentSD.CLK, GPIO_IN_PU, GPIO_PIN_SPEED_VERY_HIGH);
  gpio_set_af(currentSD.CLK, currentSD.AF_CLK);

#if defined(SD_SDIO_HAS_TRANSCEIVER)
  gpio_init_af(SD_SDIO_PIN_CKIN, SD_SDIO_AF_CKIN, GPIO_PIN_SPEED_HIGH);
  gpio_init_af(SD_SDIO_PIN_CDIR, SD_SDIO_AF_CDIR, GPIO_PIN_SPEED_HIGH);
  gpio_init_af(SD_SDIO_PIN_D0DIR, SD_SDIO_AF_D0DIR, GPIO_PIN_SPEED_HIGH);
  gpio_init_af(SD_SDIO_PIN_D123DIR, SD_SDIO_AF_D123DIR, GPIO_PIN_SPEED_HIGH);
#endif

  // SDIO Interrupt setup (priority set here; enabled after HAL_SD_Init)
  NVIC_ClearPendingIRQ(currentSD.IRQn);
  NVIC_SetPriority(currentSD.IRQn, 0);

#if defined(SD_SDIO_DMA)
  // Init SDIO DMA instance
  sdioTxDma.Instance = SD_SDIO_DMA_STREAM;
  sdioTxDma.Init.Channel = SD_SDIO_DMA_CHANNEL;
  sdioTxDma.Init.PeriphInc = DMA_PINC_DISABLE;
  sdioTxDma.Init.MemInc = DMA_MINC_ENABLE;
  sdioTxDma.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
  sdioTxDma.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
  sdioTxDma.Init.Mode = DMA_PFCTRL;
  sdioTxDma.Init.Priority = DMA_PRIORITY_VERY_HIGH;
  sdioTxDma.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
  sdioTxDma.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
  sdioTxDma.Init.MemBurst = DMA_MBURST_INC4;
  sdioTxDma.Init.PeriphBurst = DMA_PBURST_INC4;

  stm32_dma_enable_clock(SD_SDIO_DMA);
  HAL_DMA_Init(&sdioTxDma);

  __HAL_LINKDMA(&sdio, hdmatx, sdioTxDma);
  __HAL_LINKDMA(&sdio, hdmarx, sdioTxDma);

  // DMA IRQ setup (priority set here; enabled after HAL_SD_Init)
  NVIC_ClearPendingIRQ(SD_SDIO_DMA_IRQn);
  NVIC_SetPriority(SD_SDIO_DMA_IRQn, 0);
#endif
}

HAL_SD_CardInfoTypeDef cardInfo;
static DSTATUS sdio_deinitialize(BYTE lun);
static DSTATUS sdio_initialize(BYTE lun)
{
  driverState = SdioDriverState::Uninitialized;
  sdio_reset_transfer_state();

#if defined(SD2_PRESENT_GPIO)
  /* Define active SD */
  if (gpio_read(SD2_PRESENT_GPIO) == 0) {
    currentSD.periph = SDMMC2;
    currentSD.D0 = SD2_SDIO_PIN_D0;
    currentSD.AF_D0 = SD2_SDIO_AF_D0;
    currentSD.D1 = SD2_SDIO_PIN_D1;
    currentSD.AF_D1 = SD2_SDIO_AF_D1;
    currentSD.D2 = SD2_SDIO_PIN_D2;
    currentSD.AF_D2 = SD2_SDIO_AF_D2;
    currentSD.D3 = SD2_SDIO_PIN_D3;
    currentSD.AF_D3 = SD2_SDIO_AF_D3;
    currentSD.CMD = SD2_SDIO_PIN_CMD;
    currentSD.AF_CMD = SD2_SDIO_AF_CMD;
    currentSD.CLK = SD2_SDIO_PIN_CLK;
    currentSD.AF_CLK = SD2_SDIO_AF_CLK;
    currentSD.IRQn = SDMMC2_IRQn;
    currentSD.SD_CLK_DIV = SD2_SDIO_TRANSFER_CLK_DIV;
  }
#endif

  /* SDIO Peripheral Low Level Init */
  sdio_low_level_init();

  /*!< Configure the SDIO peripheral */
  /*!< SDIO_CK = SDIOCLK / (SDIO_TRANSFER_CLK_DIV + 2) */
  /*!< on STM32F4xx devices, SDIOCLK is fixed to 48MHz */

  sdio.Instance = currentSD.periph;
  sdio.Init.ClockEdge = SD_SDIO_CLOCK_EDGE_RISING;
  sdio.Init.ClockPowerSave = SD_SDIO_CLOCK_POWER_SAVE_DISABLE;
  sdio.Init.BusWide = SD_SDIO_BUS_WIDE_1B;
  sdio.Init.HardwareFlowControl = SD_SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
#if ( USE_SD_TRANSCEIVER > 0U )
  sdio.Init.TranceiverPresent = SDMMC_TRANSCEIVER_PRESENT;
#endif
#if defined(SD_SDIO_CLOCK_BYPASS_DISABLE)
  sdio.Init.ClockBypass = SD_SDIO_CLOCK_BYPASS_DISABLE;
#endif
  sdio.Init.ClockDiv = currentSD.SD_CLK_DIV;

  HAL_StatusTypeDef halStatus = HAL_SD_Init(&sdio);
  if (halStatus != HAL_OK) {
    TRACE("HAL_SD_Init() status=%d", halStatus);
    sdio_deinitialize(lun);
    /*!< CMD Response TimeOut (wait for CMDSENT flag) */
    return STA_NOINIT;
  }

  // Enable IRQs now that SDIO peripheral is fully configured
  NVIC_EnableIRQ(currentSD.IRQn);
#if defined(SD_SDIO_DMA)
  NVIC_EnableIRQ(SD_SDIO_DMA_IRQn);
#endif

  HAL_StatusTypeDef es = HAL_SD_GetCardInfo(&sdio, &cardInfo);
  if(es != HAL_OK) {
    sdio_deinitialize(lun);
    return STA_NOINIT;
  }

  halStatus = HAL_SD_ConfigWideBusOperation(&sdio, SD_SDIO_BUS_WIDE_4B);
  if (halStatus != HAL_OK) {
    TRACE("HAL_SD_ConfigWideBusOperation() status=%d", halStatus);
  } else {
    TRACE("SD Bus width successfully set to 4 bits");
  }

  TRACE("SD card info:");
  TRACE("type: %u", (uint32_t)(cardInfo.CardType));
  TRACE("class: %u", (uint32_t)(cardInfo.Class));
  TRACE("block nbr size: %u", (uint32_t)(cardInfo.BlockNbr));
  TRACE("block size: %u", (uint32_t)(cardInfo.BlockSize));

  driverState = SdioDriverState::Ready;
  return RES_OK;
}

// #if defined(SRAM_BASE)
// DMA scratch buffer used in case the input buffer is not aligned
static uint8_t scratch[BLOCK_SIZE] __DMA;
// #endif

typedef enum
{
  SD_TRANSFER_OK  = 0,
  SD_TRANSFER_BUSY = 1,
  SD_TRANSFER_ERROR
} SDTransferState;

static SDTransferState sdio_check_card_state()
{
  HAL_SD_CardStateTypeDef cardstate = HAL_SD_GetCardState(&sdio);

  if (cardstate == HAL_SD_CARD_TRANSFER) {
    return SD_TRANSFER_OK;
  }
  else if (cardstate == HAL_SD_CARD_ERROR) {
    return SD_TRANSFER_ERROR;
  }

  return SD_TRANSFER_BUSY;
}

static SdioWaitResult sdio_check_card_state_with_timeout(uint32_t timeout)
{
  uint32_t timer = HAL_GetTick();
  /* block until SDIO IP is ready again or a timeout occur */
  while(HAL_GetTick() - timer < timeout) {
    WATCHDOG_SUSPEND(100);
    auto state = sdio_check_card_state();
    if (state != SD_TRANSFER_BUSY) {
      return (state == SD_TRANSFER_OK) ? SdioWaitResult::Ready : SdioWaitResult::Error;
    }
  }

  return SdioWaitResult::Timeout;
}

static DSTATUS sdio_status(BYTE lun)
{
  DSTATUS stat = RES_OK;
  if (driverState != SdioDriverState::Ready) {
    stat |= STA_NOINIT;
  }

#if defined(SD2_PRESENT_GPIO)
  if (currentSD.periph == SDMMC2 && gpio_read(SD2_PRESENT_GPIO)) {
    stat |= STA_NODISK;
  }
#elif defined(SD_PRESENT_GPIO)
  if (gpio_read(SD_PRESENT_GPIO)) {
    stat |= STA_NODISK;
  }
#endif

  return stat;
}

static DRESULT _read_dma(BYTE* buff, DWORD sector, UINT count)
{
  if (driverState != SdioDriverState::Ready) return RES_NOTRDY;

  activeTransfer = ActiveTransfer::Read;
  ReadStatus = DmaTransferStatus::Pending;

#if __CORTEX_M >= 0x07
  SCB_CleanInvalidateDCache_by_Addr(buff, count * 512);
#endif

  if (HAL_SD_ReadBlocks_DMA(&sdio, buff, sector, count) != HAL_OK) {
    TRACE("SD ReadBlocks failed (s:%u/c:%u)", sector, (uint32_t)count);
    return sdio_fail_result(SdioFaultReason::StartReadFailed);
  }

  // Wait for the reading process to complete or a timeout to occur
  uint32_t timeout = HAL_GetTick();
  while ((ReadStatus == DmaTransferStatus::Pending) && ((HAL_GetTick() - timeout) < SD_TIMEOUT)) {
    WATCHDOG_SUSPEND(100);
  }

  if (ReadStatus == DmaTransferStatus::Success) {
    ReadStatus = DmaTransferStatus::Pending;
    activeTransfer = ActiveTransfer::None;
    return RES_OK;
  }

  if (ReadStatus == DmaTransferStatus::Error) {
    TRACE("SD read error (s:%u c:%u) err=%lu", sector, (uint32_t)count, HAL_SD_GetError(&sdio));
    return sdio_fail_result(SdioFaultReason::ReadError);
  }

  // timeout
  TRACE("SD read timeout (s:%u c:%u)", sector, (uint32_t)count);
  return sdio_fail_result(SdioFaultReason::ReadTimeout);
}

static DRESULT sdio_read(BYTE lun, BYTE * buff, DWORD sector, UINT count)
{
  DRESULT res = RES_OK;
  if (driverState != SdioDriverState::Ready) return RES_NOTRDY;

  if (sdio_check_card_state_with_timeout(SD_TIMEOUT) !=
      SdioWaitResult::Ready) {
    return sdio_fail_result(SdioFaultReason::ReadNotReady);
  }

  if (!_IS_DMA_BUFFER(buff) || !_IS_ALIGNED(buff)) {
    while (count--) {
      res = _read_dma(scratch, sector++, 1);
      if (res != RES_OK) break;
      memcpy(buff, scratch, BLOCK_SIZE);
      buff += BLOCK_SIZE;
    }
    return res;
  }

  res = _read_dma(buff, sector, count);
  if (res != RES_OK) return res;

  if (sdio_check_card_state_with_timeout(SD_TIMEOUT) !=
      SdioWaitResult::Ready) {
    TRACE("SD getstatus timeout, s:%u c:%u", sector, (uint32_t)count);
    return sdio_fail_result(SdioFaultReason::ReadNotReady);
  }

  return RES_OK;
}

static DRESULT _write_dma(const BYTE *buff, DWORD sector, UINT count)
{
  if (driverState != SdioDriverState::Ready) return RES_NOTRDY;

#if __CORTEX_M >= 0x07
  SCB_CleanDCache_by_Addr((void *)buff, count * 512);
#endif

  activeTransfer = ActiveTransfer::Write;
  WriteStatus = DmaTransferStatus::Pending;
  if (HAL_SD_WriteBlocks_DMA(&sdio, (uint8_t*)buff, sector, count) != HAL_OK) {
    TRACE("SD WriteBlocks failed (s:%u/c:%u)", sector, (uint32_t)count);
    return sdio_fail_result(SdioFaultReason::StartWriteFailed);
  }

  // Wait that the writing process is completed or a timeout occurs
  uint32_t timeout = HAL_GetTick();
  while ((WriteStatus == DmaTransferStatus::Pending) && ((HAL_GetTick() - timeout) < SD_TIMEOUT)) {
    WATCHDOG_SUSPEND(100);
  }

  if (WriteStatus == DmaTransferStatus::Success) {
    WriteStatus = DmaTransferStatus::Pending;
    activeTransfer = ActiveTransfer::None;
    return RES_OK;
  }

  if (WriteStatus == DmaTransferStatus::Error) {
    TRACE("SD write error (s:%u c:%u) err=%lu", sector, (uint32_t)count, HAL_SD_GetError(&sdio));
    return sdio_fail_result(SdioFaultReason::WriteError);
  }

  // timeout
  TRACE("SD write timeout (s:%u/c:%u)", sector, (uint32_t)count);
  return sdio_fail_result(SdioFaultReason::WriteTimeout);
}

static DRESULT sdio_write(BYTE lun, const BYTE *buff, DWORD sector, UINT count)
{
  DRESULT res = RES_OK;
  if (driverState != SdioDriverState::Ready) return RES_NOTRDY;

  if (sdio_check_card_state_with_timeout(SD_TIMEOUT) !=
      SdioWaitResult::Ready) {
    return sdio_fail_result(SdioFaultReason::WriteNotReady);
  }

  if (!_IS_DMA_BUFFER(buff) || !_IS_ALIGNED(buff)) {
    while (count--) {
      memcpy(scratch, buff, BLOCK_SIZE);
      res = _write_dma((BYTE *)scratch, sector++, 1);
      if (res != RES_OK) break;
      buff += BLOCK_SIZE;

      if (sdio_check_card_state_with_timeout(SD_TIMEOUT) !=
          SdioWaitResult::Ready) {
        return sdio_fail_result(SdioFaultReason::WriteNotReady);
      }
    }
    return res;
  }

  res = _write_dma(buff, sector, count);
  if (res != RES_OK) return res;

  if (sdio_check_card_state_with_timeout(SD_TIMEOUT) !=
      SdioWaitResult::Ready) {
    TRACE("SD getstatus timeout, s:%u c: %u", sector, (uint32_t)count);
    return sdio_fail_result(SdioFaultReason::WriteNotReady);
  }

  return RES_OK;
}

static DRESULT sdio_get_sector_count(DWORD* sectors)
{
  if (driverState != SdioDriverState::Ready) return RES_NOTRDY;

  HAL_SD_CardInfoTypeDef cardInfo;
  if(HAL_SD_GetCardInfo(&sdio, &cardInfo) != HAL_OK) {
    return RES_ERROR;
  }

  *sectors = cardInfo.LogBlockNbr;
  return RES_OK;
}

static DRESULT sdio_get_sector_size(DWORD* sector_size)
{
  if (driverState != SdioDriverState::Ready) return RES_NOTRDY;

  HAL_SD_CardInfoTypeDef cardInfo;
  if(HAL_SD_GetCardInfo(&sdio, &cardInfo) != HAL_OK) {
    return RES_ERROR;
  }

  *sector_size = cardInfo.LogBlockSize;
  return RES_OK;
}

static DRESULT sdio_get_block_size(DWORD* block_size)
{
  DWORD sector_size;
  DRESULT res = sdio_get_sector_size(&sector_size);
  if (res == RES_OK) {
    *block_size = sector_size / BLOCK_SIZE;
  }
  return res;
}

DRESULT sdio_ioctl(BYTE lun, BYTE ctrl, void *buff)
{
  if (driverState != SdioDriverState::Ready) return RES_NOTRDY;

  DRESULT res = RES_OK;
  switch (ctrl) {
    case GET_SECTOR_COUNT : /* Get number of sectors on the disk (DWORD) */
      res = sdio_get_sector_count((DWORD*)buff);
      break;

    case GET_SECTOR_SIZE :  /* Get R/W sector size (WORD) */
      res = sdio_get_sector_size((DWORD*)buff);
      break;

    case GET_BLOCK_SIZE :   /* Get erase block size in unit of sector (DWORD) */
      res = sdio_get_block_size((DWORD*)buff);
      break;

    case CTRL_SYNC:
      switch (sdio_check_card_state_with_timeout(1000)) {
        case SdioWaitResult::Ready:
          return RES_OK;
        case SdioWaitResult::Error:
        case SdioWaitResult::Timeout:
          TRACE("SD CTRL_SYNC error or timeout");
          return sdio_fail_result(SdioFaultReason::SyncTimeout);
      }
      break;

    default:
      break;
  }

  return res;
}
static DSTATUS sdio_deinitialize(BYTE lun)
{
  UNUSED(lun);

  sdio_disable_irqs();
  sdio_abort_active_transfer();
  sdio_stop_data_path();
  sdio_stop_dma();

#if defined(SD_SDIO_DMA)
  if (sdioTxDma.Instance != nullptr) {
    HAL_DMA_DeInit(&sdioTxDma);
  }
#endif

  HAL_StatusTypeDef halStatus = HAL_SD_DeInit(&sdio);

  sdio_reset_transfer_state();
  driverState = SdioDriverState::Uninitialized;

  // IRQs will be re-enabled by sdio_initialize -> sdio_low_level_init

  return (halStatus == HAL_OK) ? RES_OK : RES_ERROR;
}

const diskio_driver_t sdio_diskio_driver = {
  .initialize = sdio_initialize,
  .deinit = sdio_deinitialize,
  .status = sdio_status,
  .read = sdio_read,
  .write = sdio_write,
  .ioctl = sdio_ioctl,
};
/**
* @brief Tx Transfer completed callbacks
* @param hsd: SD handle
* @retval None
*/

extern "C" void HAL_SD_ErrorCallback(SD_HandleTypeDef *hsd)
{
  UNUSED(hsd);
  if (activeTransfer == ActiveTransfer::Read) {
    ReadStatus = DmaTransferStatus::Error;
  } else if (activeTransfer == ActiveTransfer::Write) {
    WriteStatus = DmaTransferStatus::Error;
  }
  activeTransfer = ActiveTransfer::None;
}

extern "C" void HAL_SD_TxCpltCallback(SD_HandleTypeDef *hsd)
{
  UNUSED(hsd);
  if (activeTransfer == ActiveTransfer::Write) {
    WriteStatus = DmaTransferStatus::Success;
    activeTransfer = ActiveTransfer::None;
  }
}

/**
* @brief Rx Transfer completed callbacks
* @param hsd: SD handle
* @retval None
*/

extern "C" void HAL_SD_RxCpltCallback(SD_HandleTypeDef *hsd)
{
  UNUSED(hsd);
  if (activeTransfer == ActiveTransfer::Read) {
    ReadStatus = DmaTransferStatus::Success;
    activeTransfer = ActiveTransfer::None;
  }
}

#if defined(SDMMC1)
#if defined(SDMMC1)
extern "C" void SDMMC1_IRQHandler(void)
{
  DEBUG_INTERRUPT(INT_SDIO);
  HAL_SD_IRQHandler(&sdio);
}
#endif
#if defined(SDMMC2) && defined(SD2_PRESENT_GPIO)
extern "C" void SDMMC2_IRQHandler(void)
{
  DEBUG_INTERRUPT(INT_SDIO);
  HAL_SD_IRQHandler(&sdio);
}
#endif
#else
extern "C" void SD_SDIO_IRQHandler(void)
{
  DEBUG_INTERRUPT(INT_SDIO);
  HAL_SD_IRQHandler(&sdio);
}
#endif
#if defined(SD_SDIO_DMA)
extern "C" void SD_SDIO_DMA_IRQHANDLER(void)
{
  DEBUG_INTERRUPT(INT_SDIO_DMA);
  HAL_DMA_IRQHandler(&sdioTxDma);
}
#endif

#endif
